app/views/comments/_comment.html.erb

INSERT INTO "comments" ("author", "content", "created_at", "updated_at", "event_id") VALUES ('Sid', 'this', '2011-07-17 21:59:51.279061', '2011-07-17 21:59:51.279061', 1)
---
   <span class="dateandoptions">
   	<% if(comment.created_at)%>