app/views/comments/create.js.erb

SELECT COUNT(*) FROM "comments" WHERE ("comments".event_id = 2)
---
$('#comments').prepend("<%= escape_javascript(render (@comment))%>");
$("#comments_count").html("<%= pluralize(@event.comments.size, 'Comment') %>");