app/views/users/show.html.erb

SELECT "events".* FROM "events" WHERE ("events".user_id = 20) ORDER BY events.created_at DESC
SELECT COUNT(*) FROM "events" WHERE ("events".user_id = 10)
---
</div>
<% if !@user.events.empty? %>