app/views/events/_form.html.erb

SELECT COUNT(*) FROM "authorizations" WHERE ("authorizations".user_id = 2)
---
  	<%= f.file_field :photo %></li>
  	<% if(!current_user.authorizations.empty?)%>