app/views/events/show.html.erb

	<li>
		<%= link_to User.find(attending.user_id).name, User.find(attending.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1