app/views/pages/home.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
---
<% if @array_of_events.empty? %>
<div id="no_results">No events found :(</div>
<% end %>
<% if @array_of_events.size > 5%>
<a href="#" id="more">More</a>
<a href='#' id="back_to_top">Back to Top</a>
<% end %>
<% else %>
<div id="block_header">Upcoming Events</div>
<ul id="catshowpage">
<% @array_of_events.each do |event| %>
<li><a href="/events/<%= event.id %>">
	<% if event.photo.file? %>
	<%= image_tag event.photo.url(:small), :height => 100, :width => 100 %>
	<% else %>
	<%= image_tag ("bowl3.jpg"), :height => 100, :width => 100 %>
	<% end %>
</a>

<div id="eventwords">
	<p id="event_title"><%= event.name %></p>
	<% if event.user %>

SELECT "events".* FROM "events" WHERE ("events".user_id = 1) ORDER BY events.created_at DESC
---
	  	$('#back_to_top').show();
	  }
	  to+= step;
	}
	function start(list){
		list.find('li').hide().end().find('li:lt(' + (to) + '):not(li:lt(' + from + '))').show();
		to+= step;
		if(to >= maxSize){
		  	$('#more').hide();
		  	$('#back_to_top').show();
	  }
	}
	start($('ul#catshowpage'));
	$('#more').click(function(e){
		e.preventDefault();
		showNext($('ul#catshowpage'));
	});
	$('#back_to_top').click(function(e){
		e.preventDefault();
		$("html, body").animate({ scrollTop: 0 }, 700);
	});
});