app/controllers/comments_controller.rb

    def create
      @event = Event.find_by_id(session[:event_id])
      session[:event_id] = nil
      @comment = @event.comments.build(params[:comment])
    #@comment = Event.find(params[:event]).comments.build(params[:comment])
    if @comment.save
---
SELECT "events".* FROM "events" WHERE "events"."id" = 3 ORDER BY events.created_at DESC LIMIT 1
INSERT INTO "comments" ("author", "content", "created_at", "updated_at", "event_id") VALUES ('asdf', 'asdf', '2011-06-30 04:39:08.899071', '2011-06-30 04:39:08.899071', 3)