app/controllers/events_controller.rb

SELECT "events".* FROM "events" ORDER BY events.created_at DESC
---
  def index
    @categories = ['Fraternities', 'Theater', 'Sports', 'Politics', 'Career Networking', 'Arts', 'Community Service', 'Student Council', 'Other']
    @months = ['January', 'February', 'March', 'April', 'May', 'June', 'July', 'August', 'September', 'October', 'November', 'December']

    if params[:search]
      @title = "Search"

      @array_of_events = Event.search(params[:search])

SELECT "events".* FROM "events" WHERE "events"."id" = 4 ORDER BY events.created_at DESC LIMIT 1
---
  def show
    @attending = Attending.new
    @event = Event.find(params[:id])

SELECT "events".* FROM "events" WHERE "events"."id" = 5 ORDER BY events.created_at DESC LIMIT 1
---
  def edit
    @event = Event.find(params[:id])

INSERT INTO "events" ("name", "description", "author", "facebooklink", "location", "created_at", "updated_at", "user_id", "photo_file_name", "photo_content_type", "photo_file_size", "photo_updated_at", "category", "day", "month", "year", "datescore", "date", "time", "datetime", "dayte") VALUES ('Sid''s party', 'blehbleh', 'Sid S', NULL, 'asdfasf', '2011-08-02 22:30:23.465672', '2011-08-02 22:30:23.465672', 1, NULL, NULL, NULL, NULL, 1, NULL, NULL, NULL, NULL, NULL, '2011-08-02 22:30:00.000000', NULL, '2000-01-01 00:00:00.000000')
---
  def create
    @event = current_user.events.build(params[:event])

    if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = 3 LIMIT 1
UPDATE "events" SET "author" = 'Sid', "updated_at" = '2011-06-20 21:38:56.157982' WHERE "events"."id" = 3
---
  def update
    @event = Event.find(params[:id])
    respond_to do |format|
      #Changes that need to be made
      # 1.) Make sure that the Facebook event is changed as well
      # 2.) (Update all attributes of the field)
      if(@event.facebookevent == 0 || @event.facebookevent.nil?)
        if @event.update_attributes(params[:event])