app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if params[:search]
      if(params[:search].eql?(""))
        @users = []
        @title = "Search Users"
        @header = "No Results"
      else
        @users = sort_alphabetically(User.search(params[:search]))

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1
SELECT "events".* FROM "events" WHERE ("events".user_id = 10) ORDER BY events.created_at DESC
---
  def show
    @user = User.find(params[:id])
    @title = @user.name
    @events = [] #initialize array_of events
    @events = @user.events
    @events.each do |event| #get all events with dates

INSERT INTO "users" ("name", "email", "aboutme", "affiliatedorgs", "school", "fblink", "created_at", "updated_at", "encrypted_password", "salt", "admin", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at", "fbnickname", "facebookid") VALUES ('Sid Shanker', 'bob@gmail.com', '', '', '', '', '2011-08-01 04:51:57.440290', '2011-08-01 04:51:57.440290', '266b7ae095f1c212351f0c5bd1ee88795a99f21ee876b576b4b648b2637c2d2c', '0c37b42ce75e523b281324a8b73971ea4c0c646f15827d116c56f1641d16678c', 'f', NULL, NULL, NULL, NULL, NULL, NULL)
---
  def create
    @user = User.create(params[:user])

SELECT "users".* FROM "users" WHERE "users"."id" = 7 LIMIT 1
UPDATE "users" SET "email" = 'jv@gmail.com', "updated_at" = '2011-06-22 02:19:46.354635' WHERE "users"."id" = 7
---
  def update
    @user = User.find(params[:id])
    if(params[:user][:password])
      @user.update_attributes(params[:user])