app/views/categories/_events.html.erb

SELECT "events".* FROM "events" WHERE ("events".user_id = 1) ORDER BY events.created_at DESC
---
	  	$('#more').hide();
	  	$('#back_to_top').show();
	  }
	}
	function start(list){
		list.find('li').hide().end().find('li:lt(' + (to) + '):not(li:lt(' + from + '))').show();
		if(to >= maxSize){
		  	$('#more').hide();
		  	$('#back_to_top').show();
	  }
	  to+= step;
	}
	start($('ul#catshowpage'));
	$('#more').click(function(e){
		e.preventDefault();
		showNext($('ul#catshowpage'));
	});
	$('#back_to_top').click(function(e){
		e.preventDefault();
		$("html, body").animate({ scrollTop: 0 }, 700);
	});
});